* GNU Emacs

Contributions to Emacs and the Emacs ecosystem.

#+BEGIN: clocktable :scope (lambda () (enzuru-org-files-by-tag "emacs")) :maxlevel 1
#+CAPTION: Clock summary at [2026-02-11 Wed 13:18]
| File                | Headline         | Time   |
|---------------------+------------------+--------|
|                     | ALL *Total time* | *9:47* |
|---------------------+------------------+--------|
| emacs-lispy.org     | *File time*      | *1:23* |
|                     | Lispy            | 1:23   |
|---------------------+------------------+--------|
| emacs-dark-mode.org | *File time*      | *8:24* |
|                     | Emacs dark mode  | 8:24   |
#+END:

** To do
*** TODO Cleanup config
*** TODO Switch to Nix unstable package
*** TODO Create enable-language

** Areas
*** [[../areas/emacs-lispy.org][Lispy]]

** Projects
*** [[../projects/emacs-dark-mode.org][Dark mode]]

** Documentation
*** Cider
#+BEGIN_SRC emacs-lisp
  (info "cider")
#+END_SRC
*** Common Lisp emulation
#+BEGIN_SRC emacs-lisp
  (info "cl")
#+END_SRC
*** Emacs
#+BEGIN_SRC emacs-lisp
  (info "emacs")
#+END_SRC
*** Emacs Lisp
#+BEGIN_SRC emacs-lisp
  (info "emacs lisp")
#+END_SRC
*** EIEIO
#+BEGIN_SRC emacs-lisp
  (info "EIEIO")
#+END_SRC
*** Eshell
#+BEGIN_SRC emacs-lisp
  (info "Eshell")
#+END_SRC
*** Geiser
#+BEGIN_SRC emacs-lisp
  (info "Geiser")
#+END_SRC
*** Gnus
#+BEGIN_SRC emacs-lisp
  (info "Gnus")
#+END_SRC
*** Hyperbole
#+BEGIN_SRC emacs-lisp
  (info "Hyperbole")
#+END_SRC
*** Sly
#+BEGIN_SRC emacs-lisp
  (info "SLY")
#+END_SRC
*** org-mode
#+BEGIN_SRC emacs-lisp
  (info "Org")
#+END_SRC
